let urls = [
    "/bike.html",
    "/ukulele.html",
    "/read.html",
    "/photo.html",

];
document.getElementById("random-link").addEventListener("click", function(){
    let url = urls[Math.floor(Math.random()*urls.length)]
    this.href = url;
});

/*
    document.getElementById()
    Возвращает ссылку на элемент по его идентификатору (ID (en-US));
    идентификатор является строкой, которая может быть использована для идентификации элемента;
    она может быть определена при помощи атрибута id в HTML или из скрипта.
*/

/*
    .addEventListener()
    Добавляет элементу действие, которое будет выполнено после срабатывания события.
    Например, на клик мышки или нажатие клавиши.
*/

/*
    Math.floor
    Функция Math.floor()всегда округляет в меньшую сторону
    и возвращает наибольшее целое число, меньшее или равное заданному числу.
*/

/*
    Функция Math.random()возвращает псевдослучайное число с плавающей запятой,
    которое больше или равно 0 и меньше 1, с примерно равномерным распределением в этом диапазоне,
    которое затем можно масштабировать до нужного диапазона.
    Реализация выбирает начальное начальное число для алгоритма генерации случайных чисел;
    он не может быть выбран или сброшен пользователем.
* */